In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [62]:
data=pd.read_csv(r"C:\Users\etisalat\ML using python\preprocessing\loan_small.csv")

In [63]:
data.head()

,Loan_ID,Gender,ApplicantIncome,CoapplicantIncome,LoanAmount,Area,Loan_Status
0,LP001002,NaN,5849.0,0.0,NaN,urban,Y
1,LP001003,Male,4583.0,NaN,128.0,semi,N
2,LP001005,Male,3000.0,0.0,66.0,NaN,Y
3,LP001006,Female,2583.0,2358.0,120.0,semi,NaN
4,LP001008,Male,NaN,0.0,141.0,urban,Y

In [64]:
data["Gender"].head()

0       NaN
1      Male
2      Male
3    Female
4      Male
Name: Gender, dtype: object

In [65]:
data.iloc[:,1]

0        NaN
1       Male
2       Male
3     Female
4       Male
5       Male
6       Male
7     Female
8       Male
9       Male
10    Female
11      Male
12    Female
13      Male
14      Male
15      Male
Name: Gender, dtype: object

In [66]:
data[["Gender" , "LoanAmount","Area"]]

    Gender  LoanAmount   Area
0      NaN         NaN  urban
1     Male       128.0   semi
2     Male        66.0    NaN
3   Female       120.0   semi
4     Male       141.0  urban
5     Male       267.0   semi
6     Male         NaN  rural
7   Female       158.0   semi
8     Male       168.0  rural
9     Male       349.0   semi
10  Female        70.0  urban
11    Male       109.0  urban
12  Female         NaN  urban
13    Male       114.0  urban
14    Male        17.0   semi
15    Male       125.0   semi

In [67]:
data[["Gender" , "LoanAmount","Area"]][6:11]

    Gender  LoanAmount   Area
6     Male         NaN  rural
7   Female       158.0   semi
8     Male       168.0  rural
9     Male       349.0   semi
10  Female        70.0  urban

### getting datatypes

In [68]:
data.dtypes

Loan_ID               object
Gender                object
ApplicantIncome      float64
CoapplicantIncome    float64
LoanAmount           float64
Area                  object
Loan_Status           object
dtype: object

In [69]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 7 columns):
Loan_ID              16 non-null object
Gender               15 non-null object
ApplicantIncome      14 non-null float64
CoapplicantIncome    15 non-null float64
LoanAmount           13 non-null float64
Area                 15 non-null object
Loan_Status          15 non-null object
dtypes: float64(3), object(4)
memory usage: 976.0+ bytes

In [70]:
data.describe()

       ApplicantIncome  CoapplicantIncome  LoanAmount
count        14.000000          15.000000   13.000000
mean       4103.571429        2509.333333  140.923077
std        2858.096481        3147.982090   86.032418
min        1299.000000           0.000000   17.000000
25%        2520.750000         350.000000  109.000000
50%        3118.000000        1526.000000  125.000000
75%        4858.250000        2672.000000  158.000000
max       12841.000000       10968.000000  349.000000

In [71]:
data.isnull().sum()

Loan_ID              0
Gender               1
ApplicantIncome      2
CoapplicantIncome    1
LoanAmount           3
Area                 1
Loan_Status          1
dtype: int64

In [72]:
round(data["ApplicantIncome"].mean(),1)

4103.6

In [73]:
data["ApplicantIncome"]=data["ApplicantIncome"].fillna(round(data["ApplicantIncome"].mean(),1))
data["CoapplicantIncome"]=data["CoapplicantIncome"].fillna(round(data["CoapplicantIncome"].mean(),1))
data["LoanAmount"]=data["LoanAmount"].fillna(round(data["LoanAmount"].mean(),1))

In [74]:
data.isnull().sum()

Loan_ID              0
Gender               1
ApplicantIncome      0
CoapplicantIncome    0
LoanAmount           0
Area                 1
Loan_Status          1
dtype: int64

In [75]:
data["Gender"].mode()[0]

'Male'

In [76]:
data["Gender"]=data["Gender"].fillna(data["Gender"].mode()[0])
data["Area"]=data["Area"].fillna(data["Area"].mode()[0])

In [77]:
data.isnull().sum()

Loan_ID              0
Gender               0
ApplicantIncome      0
CoapplicantIncome    0
LoanAmount           0
Area                 0
Loan_Status          1
dtype: int64

In [78]:
data.dropna(inplace=True)

In [79]:
data.isnull().sum()

Loan_ID              0
Gender               0
ApplicantIncome      0
CoapplicantIncome    0
LoanAmount           0
Area                 0
Loan_Status          0
dtype: int64

In [80]:
a=list(data["Area"])
a.count("urban")

6

In [81]:
data["Area"].unique()

array(['urban', 'semi', 'rural'], dtype=object)

In [82]:
data.groupby("Area").count()

,Loan_ID,Gender,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Status
Area,,,,,,
rural,2,2,2,2,2,2
semi,7,7,7,7,7,7
urban,6,6,6,6,6,6

### label encoding

In [47]:
data.head()

,Loan_ID,Gender,ApplicantIncome,CoapplicantIncome,LoanAmount,Area,Loan_Status
0,LP001002,Male,5849.0,0.0,140.9,urban,Y
1,LP001003,Male,4583.0,2509.3,128.0,semi,N
2,LP001005,Male,3000.0,0.0,66.0,semi,Y
4,LP001008,Male,4103.6,0.0,141.0,urban,Y
5,LP001011,Male,5417.0,4196.0,267.0,semi,Y

In [50]:
data.drop(labels=["Loan_ID"],inplace=True,axis=1) # axis=0 ==> rows , 1 means Column

KeyError: "labels ['Loan_ID'] not contained in axis"

In [51]:
data.head()

  Gender  ApplicantIncome  CoapplicantIncome  LoanAmount   Area Loan_Status
0   Male           5849.0                0.0       140.9  urban           Y
1   Male           4583.0             2509.3       128.0   semi           N
2   Male           3000.0                0.0        66.0   semi           Y
4   Male           4103.6                0.0       141.0  urban           Y
5   Male           5417.0             4196.0       267.0   semi           Y

### Label Encoding

In [54]:
from sklearn.preprocessing import LabelEncoder # ==> class

In [55]:
encoder=LabelEncoder()

In [59]:
data["Gender"]=encoder.fit_transform(data["Gender"])
data["Area"]=encoder.fit_transform(data["Area"])
data["Loan_Status"]=encoder.fit_transform(data["Loan_Status"])

In [60]:
data.head()

   Gender  ApplicantIncome  CoapplicantIncome  LoanAmount  Area  Loan_Status
0       1           5849.0                0.0       140.9     2            1
1       1           4583.0             2509.3       128.0     1            0
2       1           3000.0                0.0        66.0     1            1
4       1           4103.6                0.0       141.0     2            1
5       1           5417.0             4196.0       267.0     1            1

In [61]:
encoder.classes_

array(['N', 'Y'], dtype=object)

### One Hot Encoding

In [83]:
data2=data.copy()

In [84]:
data2

,Loan_ID,Gender,ApplicantIncome,CoapplicantIncome,LoanAmount,Area,Loan_Status
0,LP001002,Male,5849.0,0.0,140.9,urban,Y
1,LP001003,Male,4583.0,2509.3,128.0,semi,N
2,LP001005,Male,3000.0,0.0,66.0,semi,Y
4,LP001008,Male,4103.6,0.0,141.0,urban,Y
5,LP001011,Male,5417.0,4196.0,267.0,semi,Y
6,LP001013,Male,2333.0,1516.0,140.9,rural,Y
7,LP001014,Female,3036.0,2504.0,158.0,semi,N
8,LP001018,Male,4006.0,1526.0,168.0,rural,Y
9,LP001020,Male,12841.0,10968.0,349.0,semi,N
10,LP001024,Female,3200.0,700.0,70.0,urban,Y
11,LP001027,Male,2500.0,1840.0,109.0,urban,Y
12,LP001028,Female,4103.6,8106.0,140.9,urban,Y
13,LP001029,Male,1853.0,2840.0,114.0,urban,N
14,LP001030,Male,1299.0,1086.0,17.0,semi,Y
15,LP001032,Male,4950.0,0.0,125.0,semi,Y

In [85]:
data2.drop(labels=["Loan_ID"],inplace=True,axis=1) # axis=0 ==> rows , 1 means Column

In [86]:
data2

    Gender  ApplicantIncome  CoapplicantIncome  LoanAmount   Area Loan_Status
0     Male           5849.0                0.0       140.9  urban           Y
1     Male           4583.0             2509.3       128.0   semi           N
2     Male           3000.0                0.0        66.0   semi           Y
4     Male           4103.6                0.0       141.0  urban           Y
5     Male           5417.0             4196.0       267.0   semi           Y
6     Male           2333.0             1516.0       140.9  rural           Y
7   Female           3036.0             2504.0       158.0   semi           N
8     Male           4006.0             1526.0       168.0  rural           Y
9     Male          12841.0            10968.0       349.0   semi           N
10  Female           3200.0              700.0        70.0  urban           Y
11    Male           2500.0             1840.0       109.0  urban           Y
12  Female           4103.6             8106.0       140.9  urban           Y
13    Male           1853.0             2840.0       114.0  urban           N
14    Male           1299.0             1086.0        17.0   semi           Y
15    Male           4950.0                0.0       125.0   semi           Y

In [97]:
data2=pd.get_dummies(data2,drop_first=True)

In [89]:
cd

C:\Users\etisalat

### normalization

In [98]:
data3=data2.copy()

In [99]:
data3

,ApplicantIncome,CoapplicantIncome,LoanAmount,Gender_Male,Area_semi,Area_urban,Loan_Status_Y
0,5849.0,0.0,140.9,1,0,1,1
1,4583.0,2509.3,128.0,1,1,0,0
2,3000.0,0.0,66.0,1,1,0,1
4,4103.6,0.0,141.0,1,0,1,1
5,5417.0,4196.0,267.0,1,1,0,1
6,2333.0,1516.0,140.9,1,0,0,1
7,3036.0,2504.0,158.0,0,1,0,0
8,4006.0,1526.0,168.0,1,0,0,1
9,12841.0,10968.0,349.0,1,1,0,0
10,3200.0,700.0,70.0,0,0,1,1
11,2500.0,1840.0,109.0,1,0,1,1
12,4103.6,8106.0,140.9,0,0,1,1
13,1853.0,2840.0,114.0,1,0,1,0
14,1299.0,1086.0,17.0,1,1,0,1
15,4950.0,0.0,125.0,1,1,0,1

### using z-score (-1 -->1)

In [100]:
from sklearn.preprocessing import StandardScaler

In [101]:
scaler=StandardScaler()

In [102]:
scaler.fit(data3)

C:\Users\etisalat\anacondanew\Anaconda3\lib\site-packages\sklearn\preprocessing\data.py:645: DataConversionWarning: Data with input dtype uint8, float64 were all converted to float64 by StandardScaler.
  return self.partial_fit(X, y)

StandardScaler(copy=True, with_mean=True, with_std=True)

In [103]:
data3_scaled=scaler.transform(data3)

C:\Users\etisalat\anacondanew\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DataConversionWarning: Data with input dtype uint8, float64 were all converted to float64 by StandardScaler.
  """Entry point for launching an IPython kernel.

In [ ]:
#scaler.fit_transform

In [104]:
data3_scaled

array([[ 0.62519515, -0.82849171, -0.01841542,  0.5       , -0.93541435,
         1.22474487,  0.60302269],
       [ 0.14376487, -0.00332788, -0.18649957,  0.5       ,  1.06904497,
        -0.81649658, -1.6583124 ],
       [-0.45821312, -0.82849171, -0.99434587,  0.5       ,  1.06904497,
        -0.81649658,  0.60302269],
       [-0.03853977, -0.82849171, -0.01711244,  0.5       , -0.93541435,
         1.22474487,  0.60302269],
       [ 0.46091562,  0.55133032,  1.62463971,  0.5       ,  1.06904497,
        -0.81649658,  0.60302269],
       [-0.71185767, -0.32996688, -0.01841542,  0.5       , -0.93541435,
        -0.81649658,  0.60302269],
       [-0.44452316, -0.00507075,  0.2043938 , -2.        ,  1.06904497,
        -0.81649658, -1.6583124 ],
       [-0.07565478, -0.32667846,  0.33469159,  0.5       , -0.93541435,
        -0.81649658,  0.60302269],
       [ 3.28408974,  2.77824996,  2.69308159,  0.5       ,  1.06904497,
        -0.81649658, -1.6583124 ],
       [-0.38215779, -0.59830215, -0.94222675, -2.        , -0.93541435,
         1.22474487,  0.60302269],
       [-0.64835147, -0.22342199, -0.43406537,  0.5       , -0.93541435,
         1.22474487,  0.60302269],
       [-0.03853977,  1.83710347, -0.01841542, -2.        , -0.93541435,
         1.22474487,  0.60302269],
       [-0.89439048,  0.10542024, -0.36891648,  0.5       , -0.93541435,
         1.22474487, -1.6583124 ],
       [-1.10506377, -0.47136904, -1.63280504,  0.5       ,  1.06904497,
        -0.81649658,  0.60302269],
       [ 0.28332641, -0.82849171, -0.22558891,  0.5       ,  1.06904497,
        -0.81649658,  0.60302269]])

### Minmax (0--->1)

In [108]:
from sklearn.preprocessing import MinMaxScaler

In [109]:
scaler2=MinMaxScaler()

In [110]:
scaler2.fit(data3)

C:\Users\etisalat\anacondanew\Anaconda3\lib\site-packages\sklearn\preprocessing\data.py:334: DataConversionWarning: Data with input dtype uint8, float64 were all converted to float64 by MinMaxScaler.
  return self.partial_fit(X, y)

MinMaxScaler(copy=True, feature_range=(0, 1))

In [111]:
data3_scaled2=scaler2.transform(data3)

In [112]:
data3_scaled2

array([[0.39421244, 0.        , 0.37319277, 1.        , 0.        ,
        1.        , 1.        ],
       [0.28452608, 0.22878373, 0.33433735, 1.        , 1.        ,
        0.        , 0.        ],
       [0.14737481, 0.        , 0.14759036, 1.        , 1.        ,
        0.        , 1.        ],
       [0.24299082, 0.        , 0.37349398, 1.        , 0.        ,
        1.        , 1.        ],
       [0.35678392, 0.38256747, 0.75301205, 1.        , 1.        ,
        0.        , 1.        ],
       [0.08958586, 0.13822028, 0.37319277, 1.        , 0.        ,
        0.        , 1.        ],
       [0.15049385, 0.22830051, 0.4246988 , 0.        , 1.        ,
        0.        , 0.        ],
       [0.23453474, 0.13913202, 0.45481928, 1.        , 0.        ,
        0.        , 1.        ],
       [1.        , 1.        , 1.        , 1.        , 1.        ,
        0.        , 0.        ],
       [0.16470282, 0.06382203, 0.15963855, 0.        , 0.        ,
        1.        , 1.        ],
       [0.10405476, 0.16776076, 0.27710843, 1.        , 0.        ,
        1.        , 1.        ],
       [0.24299082, 0.73905908, 0.37319277, 0.        , 0.        ,
        1.        , 1.        ],
       [0.04799861, 0.25893508, 0.29216867, 1.        , 0.        ,
        1.        , 0.        ],
       [0.        , 0.09901532, 0.        , 1.        , 1.        ,
        0.        , 1.        ],
       [0.31632299, 0.        , 0.3253012 , 1.        , 1.        ,
        0.        , 1.        ]])

In [113]:
pd.DataFrame(data3_scaled2)

           0         1         2    3    4    5    6
0   0.394212  0.000000  0.373193  1.0  0.0  1.0  1.0
1   0.284526  0.228784  0.334337  1.0  1.0  0.0  0.0
2   0.147375  0.000000  0.147590  1.0  1.0  0.0  1.0
3   0.242991  0.000000  0.373494  1.0  0.0  1.0  1.0
4   0.356784  0.382567  0.753012  1.0  1.0  0.0  1.0
5   0.089586  0.138220  0.373193  1.0  0.0  0.0  1.0
6   0.150494  0.228301  0.424699  0.0  1.0  0.0  0.0
7   0.234535  0.139132  0.454819  1.0  0.0  0.0  1.0
8   1.000000  1.000000  1.000000  1.0  1.0  0.0  0.0
9   0.164703  0.063822  0.159639  0.0  0.0  1.0  1.0
10  0.104055  0.167761  0.277108  1.0  0.0  1.0  1.0
11  0.242991  0.739059  0.373193  0.0  0.0  1.0  1.0
12  0.047999  0.258935  0.292169  1.0  0.0  1.0  0.0
13  0.000000  0.099015  0.000000  1.0  1.0  0.0  1.0
14  0.316323  0.000000  0.325301  1.0  1.0  0.0  1.0

### spliting the data into (training & testing)

In [114]:
from sklearn.model_selection import train_test_split

In [115]:
data3_scaled2.shape

(15, 7)

In [118]:
training,testing=train_test_split(data3_scaled2,test_size=0.3)

In [121]:
training.shape

(10, 7)

In [122]:
testing.shape

(5, 7)